linkachuECE/MasteringMCU/MCU1/stm32f4xx_drivers/drivers/Inc/stm32407xx_gpio_driver.h
/*
 * stm324707xx_gpio_driver.h
 *
 *  Created on: Sep 3, 2022
 *      Author: linkachu
 */

#ifndef INC_STM32407XX_GPIO_DRIVER_H_
#define INC_STM32407XX_GPIO_DRIVER_H_

#include "stm32f407xx.h"

typedef struct{
	uint8_t GPIO_PinNumber;			/*!< possible values from @GPIO_PIN_NUMBERS>*/
	uint8_t GPIO_PinMode;			/*!< possible values from @GPIO_PIN_MODES>*/
	uint8_t GPIO_PinSpeed;			/*!< possible values from @GPIO_PIN_SPEED>*/
	uint8_t GPIO_PinPuPdControl;	/*!< possible values from @GPIO_PIN_PUPD>*/
	uint8_t GPIO_PinOPType;			/*!< possible values from @GPIO_OUTPUT_TYPE>*/
	uint8_t GPIO_PinAltFunMode;
} GPIO_PinConfig_t;

typedef struct{
	GPIO_RegDef_t *pGPIOx; // This is a pointer to the base address of the GPIO port to which the pin belongs
	GPIO_PinConfig_t GPIO_PinConfig;
} GPIO_Handle_t;

// ******************* CONFIGURATION MACROS *******************//

/*
 * @GPIO_PIN_NUMBER
 * GPIO pin possible numbers
 */
#define GPIO_PIN_NO_0			0
#define GPIO_PIN_NO_1			1
#define GPIO_PIN_NO_2			2
#define GPIO_PIN_NO_3			3
#define GPIO_PIN_NO_4			4
#define GPIO_PIN_NO_5			5
#define GPIO_PIN_NO_6			6
#define GPIO_PIN_NO_7			7
#define GPIO_PIN_NO_8			8
#define GPIO_PIN_NO_9			9
#define GPIO_PIN_NO_10			10
#define GPIO_PIN_NO_11			11
#define GPIO_PIN_NO_12			12
#define GPIO_PIN_NO_13			13
#define GPIO_PIN_NO_14			14
#define GPIO_PIN_NO_15			15

/*
 * @GPIO_PIN_MODES
 * GPIO pin possible modes
 */
#define GPIO_MODE_IN 		0
#define GPIO_MODE_OUT 		1
#define GPIO_MODE_ALTFN		2
#define GPIO_MODE_ANALOG	3
#define GPIO_MODE_IT_FT		4		// Falling-edge detection
#define GPIO_MODE_IT_RT		5		// Rising-edge detection
#define GPIO_MODE_IT_RFT	6		// Rising and falling edge detection

/*
 * @GPIO_OUTPUT_TYPE
 * GPIO output types
 */
#define GPIO_OP_TYPE_PP		0
#define GPIO_OP_TYPE_OD		1

/*
 * @GPIO_PIN_SPEED
 * GPIO output speeds
 */
#define GPIO_SPEED_LOW		0
#define GPIO_SPEED_MEDIUM	1
#define GPIO_SPEED_FAST		2
#define GPIO_SPEED_HIGH		3

/*
 * @GPIO_PIN_PUPD
 * GPIO pull-up/pull-down values
 */
#define GPIO_NO_PUPD		0
#define GPIO_PU				1
#define GPIO_PD				2

// *********** API PROTOTYPES ************* //

// Peripheral clock setup
void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi);

// Init and de-enit
void GPIO_Init(GPIO_Handle_t *pGPIOHandle);
void GPIO_DeInit(GPIO_RegDef_t *pGPIOx);

// Data read and write
uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx, uint8_t pinNumber);
uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx);
void GPIO_WriteToOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t pinNumber, uint8_t value);
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx, uint16_t value);
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t pinNumber);

// IRQ
void GPIO_IRQInterruptConfig(uint8_t IRQNumber, uint32_t IRQPriority, uint8_t EnorDi);
void GPIO_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void GPIO_IRQHandling(uint8_t pinNumber);

#endif /* INC_STM32407XX_GPIO_DRIVER_H_ */
